%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%
%A  grphomom.msk                GAP documentation            Alexander Hulpke
%%
%A  @(#)$Id$
%%
%Y  (C) 1998 School Math and Comp. Sci., University of St.  Andrews, Scotland
%%
\Chapter{Group Homomorphisms}

A group homomorphism is a general mapping that is total and single valued
and respects multiplication and inverses (see "IsGroupHomomorphism").

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Creating group homomorphisms}

\Declaration{GroupGeneralMappingByImages}
\Declaration{GroupHomomorphismByImages}
\Declaration{GroupHomomorphismByImagesNC}

\Declaration{AsGroupGeneralMappingByImages}

\Declaration{NaturalHomomorphismByNormalSubgroup}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Representations for group homomorphisms}

\Declaration{IsGroupGeneralMappingByImages}
\Declaration{IsGroupGeneralMappingByPcgs}
\Declaration{IsGroupGeneralMappingByAsGroupGeneralMappingByImages}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Group Automorphisms}

\Declaration{InnerAutomorphism}

\Declaration{AutomorphismGroup}
\Requirements
\beginexample
gap> g:=Group((1,2,3,4),(1,3));
Group( [ (1,2,3,4), (1,3) ], ... )
gap> au:=AutomorphismGroup(g);
Group( 
[ ^(1,2,3,4), ^(1,3), [ (1,2,3,4), (1,3) ] -> [ (1,2,3,4), (1,2)(3,4) ] 
 ], ... )
gap> NiceObject(au);   
Group( [ (1,4)(2,6), (2,6)(3,5), (1,2,4,6) ], ... )
\endexample

\Declaration{InnerAutomorphismsAutomorphismGroup}
\beginexample
gap> InnerAutomorphismsAutomorphismGroup(au);
Group( [ ^(1,2,3,4), ^(1,3) ], ... )
\endexample

\Declaration{InducedAutomorphism}
\Requirements
\beginexample
gap> g:=Group((1,2,3,4),(1,2));
Group( [ (1,2,3,4), (1,2) ], ... )
gap> n:=Subgroup(g,[(1,2)(3,4),(1,3)(2,4)]);
Group( [ (1,2)(3,4), (1,3)(2,4) ], ... )
gap> epi:=NaturalHomomorphismByNormalSubgroup(g,n);
[ (3,4), (2,4,3), (1,2)(3,4), (1,3)(2,4) ] -> 
[ f1, f2, <identity> of ..., <identity> of ... ]
gap> aut:=InnerAutomorphism(g,(1,2,3));
^(1,2,3)
gap> InducedAutomorphism(epi,aut);
^f2
\endexample

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Searching for homomorphisms}

\Declaration{IsomorphismGroups}
\Requirements
\beginexample
gap> g:=Group((1,2,3,4),(1,3));;
gap> h:=Group((1,4,6,7)(2,3,5,8), (1,5)(2,6)(3,4)(7,8));;
gap> IsomorphismGroups(g,h);
[ (1,2,3,4), (1,3) ] -> [ (1,4,6,7)(2,3,5,8), (1,5)(2,6)(3,4)(7,8) ]
gap> IsomorphismGroups(g,Group((1,2,3,4),(1,2)));
fail
\endexample

\Declaration{GQuotients}
\Requirements
\beginexample
gap> g:=Group((1,2,3,4),(1,2));
Group( [ (1,2,3,4), (1,2) ], ... )
gap> h:=Group((1,2,3),(1,2));
Group( [ (1,2,3), (1,2) ], ... )
gap> quo:=GQuotients(g,h);
[ [ (1,3,2,4), (2,4,3) ] -> [ (2,3), (1,2,3) ] ]
\endexample

\Declaration{MorClassLoop}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Expressing group elements as words in generators}

\index{factorization}
\index{words!in generators}

Homomorphisms also provide a way to express group elements as words in given
generators: Create a free group on the right number of generators and create
a homomorphism from this free group onto the group <G> in whose generators you
want to factorize. Then the preimage of an element of <G> is a word in the
free generators, that will map on this element again. The following example
shows how to decompose elements of $S_4$ in the generators `(1,2,3,4)' and
`(1,2)':

\beginexample
gap> g:=Group((1,2,3,4),(1,2));
Group( [ (1,2,3,4), (1,2) ], ... )
gap> f:=FreeGroup("x","y");
Group( [ x, y ], ... )
gap> hom:=GroupHomomorphismByImagesNC(f,g,GeneratorsOfGroup(f),               
> GeneratorsOfGroup(g));                                                   
[ x, y ] -> [ (1,2,3,4), (1,2) ]
gap> PreImagesRepresentative(hom,(2,3,4));
y^-1*x^-1*y^-1*x^-1
\endexample

